<template>
  <div class="con">
      <h2 class="name">
      {{ monthName }} 
      </h2>
      <table>
          <tr>
              <th v-for="weekName in weekShortNames">
                  <div class="table-header">
                      {{ weekName }}
                  </div>
              </th>
          </tr>
          <tr v-for="week in weeksCount" class="day-between">
              <td v-for="day in 7" >
                  <GridDay
                      :schedule="schedule[week-1][day - 1]"
                  />
              </td>
          </tr>
          </table>
  </div>
</template>

<script>
import GridDay from '@/components/GridDay.vue'
export default {
  data() {
      return {
          monthName: "Апрель",
          weeksCount: Math.round(30 / 7),
          weekShortNames: ['10.04.24', '11.04.24', '12.04.24', '13.04.24', '14.04.24', '15.04.24', '16.04.24'],
          schedule: [
              [
                  [

                      {
                          "id": 9835,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 00:00:00",
                          "title": "«Коллеги»",
                          "text": "В Новосибирске впервые прошел международный форум IN-HUB, на котором собрались ведущие изобретатели со всей страны и еще нескольких государств.В эту же неделю вручали Нобелевскую премию, то и эту тему обойти было невозможно. В итоге и получился такой специальный выпуск – от сибирских событий к международным. \n\nРусский народный танец «Калинка». Поможет ли он освоить русский язык? В институте филологии и массмедиа КГУ имени Циолковского уверены, что да. Уже несколько лет здесь ведется активная работа с инофонами по обучению детей и их родителей из ближнего и дальнего зарубежья русскому языку. Выпуск программы «Культурная среда посвящен фестивалю «Этнодиалог». Национальный образ мира», который прошел в КГУ. Среди участников - Россия, Китай, Ангола, Узбекистан, Иемен. В программе вы увидите разницу в построении русской хореографии от танцев Кот-д’Ивуара. ",
                          "duration": 2400,
                          "age": "12+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      },
                      {
                          "id": 9836,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 00:40:00",
                          "title": "\"Страна поэтов\" №157",
                          "text": null,
                          "duration": 0,
                          "age": "0+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      },
                      {
                          "id": 9837,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 00:45:00",
                          "title": "Спецпроект ОТР. Конструкторы будущего. «Я вам пишу... »",
                          "text": "Система нейрокоммуникации и нейротренинга. Создаёт возможность сетевого общения для людей с ограничением речи и движений. Позволяет проводить тренинг когнитивной сферы и развивать ресурсы собственного мозга.\nКоммуникационная система НейроЧат создаёт возможность сетевого общения людей, не имеющих сегодня возможности говорить и двигаться, людей с такими диагнозами, как: ДЦП, БАС, инсульт, рассеянный склероз и различными нейротравмами (ЧМТ, спинальные травмы и другие) с родными, медицинским персоналом, друзьями и всем миром. Система нейротренинга НейроЧат позволяет развивать и тренировать когнитивные функции человека, такие как: внимание, память, скорость реакции и др., анализируя электрофизиологические параметры работы головного мозга.\n",
                          "duration": 600,
                          "age": "12+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      },
                      {
                          "id": 9838,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 01:00:00",
                          "title": "«Большая страна»",
                          "text": "ТЕМА: ЛЮДИ ГОВОРЯТ\n\nИстории и легенды Тулы\nГород Тула славен не только своими пряниками и самоварами. Он еще хранит много тайн и загадок. Вот, например, после сгоревшего дома промышленника Демидова, остались подземные ходы. Не разгадано до сих пор тайна прототипа героя рассказа «Левша». До сих пор ходит предание о дочери купца Лугинина. Согласно другому преданию, на старинном кладбище до 30-х годов прошлого века в дупле большого тополя жил монах.Но затмила всех история жизни подлинной исторической личности - «самоварного короля» - Алексея Баташева. \n\nЖуткое прошлое усадьбы Асеева\nУсадьба Асеева – одна из самых известных Тамбовских достопримечательностей. Настоящий дворец, мини-Петергоф. Но мало кто знает, что самое интересное не в прекрасных старинных интерьерах, а глубоко под землей или даже водой скрыто здесь от людских глаз и окутано тайной.... Говорят, сам Асеев приказал вырыть под усадьбой тайный ход, а злой и хитрый управляющий, чтобы не платить рабочим, тайно убил их и бросил в озеро. С утра люди, идущие на работу увидели, что вся вода была красной от крови, но пока бегали за полицией, все исчезло. Но озеро с тех пор называют красным. Именно в этом мистическом месте соберутся на слет те, кто сейчас называют себя магами и экстрасенсами. Тайн усадьбы они не знают и попробуют выполнить задания историков-исследователей и отыскать в светлой и красивой усадьбе с помощью своей магии места, связанные с жестокими чародеями прошлого. Удастся ли им это?  И были все эти страшные события или все это только городские легенды? \n\nМистический Барнаул \nГолубая дама, проклятие Демидова, призраки подземелий и подвалов, стоны расстрелянных – Барнаул полон таинственных историй. Город промышленный, но по его улицам, в домах его жителей бродят... призраки. Пожалуй, наиболее известной является легенда о Голубой даме. Согласно ей, в XIX веке в здании, где сейчас располагается городская администрация, жил начальник горного округа вместе с женой. Узнав о любви к молодому ссыльному офицеру, женщину замуровали в здании. Призрак дамы гуляет по коридорам, а ночью выходит на балкон. Некоторые утверждают, что видели ее там, другие слышали голос, третьи наблюдали даму около ее бывшего дома. Еще одна легенда связана с этими же местами. По легенде между Дворцом бракосочетаний и соседним зданием существует подземный ход, в котором приводили в действие приговор о смертной казни. А в самих подвалах зданий содержали заключенных, которым предстояло быть расстрелянными. О привидениях этих людей часто рассказывают работники зданий. Ясно одно, что ни одна городская легенда не появится не на пустом месте. Узнаем все о таинственных местах Барнаула. Послушаем свидетелей. Расскажем барнаульские истории о призраках....\n",
                          "duration": 3300,
                          "age": "12+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      },
                      {
                          "id": 9839,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 01:55:00",
                          "title": "\"Страна поэтов\" №141",
                          "text": null,
                          "duration": 0,
                          "age": "0+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      },
                      {
                          "id": 9840,
                          "orbit_id": 1,
                          "broadcast_date": "2022-12-03 01:55:00",
                          "title": "«Календарь»",
                          "text": "3 декабря, суббота\n\nОбзор выпусков «Календаря» за неделю, дайджест\n",
                          "duration": 1500,
                          "age": "12+",
                          "country": null,
                          "year": null,
                          "live": "0"
                      }
                  ],
                  [
                    {
                      "id": 701364,
                      "orbit_id": 2,
                      "broadcast_date": "2022-12-28 04:45:00",
                      "title": "«Песня остается с человеком». №6",
                      "text": "Ландыши  Популярная песня композитора Оскара Фельцмана на стихи Ольги Фадеевой (Кляйнер), написанная в 1958 году",
                      "duration": 900,
                      "age": "12+",
                      "country": null,
                      "year": null,
                      "live": "0"
                    },
                    {
                      "id": 701365,
                      "orbit_id": 2,
                      "broadcast_date": "2022-12-28 05:00:00",
                      "title": "ОТРажение-1. Информационная программа ",
                      "text": null,
                      "duration": 3300,
                      "age": null,
                      "country": null,
                      "year": null,
                      "live": "1"
                    }
                  ]
              ]

          ]
      }
  },
  components: {
      GridDay
  }
}
</script>

<style>

table {
  width: 100%;
  border-collapse: collapse;
}

.con {
  margin-top: 1rem;
  padding-bottom: 2rem;
}

.table-header {
  margin-top: .5rem;
  background-color: rgb(203, 203, 203);
}

.name {
  text-align: center;
}
</style>
